package com.javarush.test.level05.lesson12.home04;

/* Вывести на экран сегодняшнюю дату
Вывести на экран текущую дату в аналогичном виде "21 12 2012".
*/

//import java.util.Date;


public class Solution
{
    public static void main(String[] args)
    {
        //Date current = new Date();
        //System.out.println("\"22 07 2014\"");
        //System.out.printf("%td%<tm%<tY",current);
        System.out.println("22 07 2014");
    }
}
